posts/2017-09-24-on-passing-judgment.org
#+title: "On Passing Judgment"
#+filetags: prayer religion
#+date: <2017-09-24>

One of last week's lectionary texts was Romans 14:1-12.

>Why do you pass judgment on your brother or sister? Or you, why do you despise your brother or sister? For we will all stand before the judgment seat of God. (Rom. 14:10, NRSV)

God of Grace,

In belittling others,\\
I am made small.

By doubting their faith,\\
I cheapen my own.

In my haste to judge,\\
I am the one condemned.

The day will come,\\
when my time on earth\\
is finally weighed.

If I am found wanting,\\
let it be for my\\
failure to judge,\\
and not for my\\
failure to love.

/Amen/
