docs/posts/2017-09-24-on-passing-judgment.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 20, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>On Passing Judgment</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/neat.css' type='text/css'/>
<link rel='stylesheet' href='/css/custom.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">On Passing Judgment</h1>
<p class="subtitle" role="doc-subtitle">Sep 24, 2017</p>
</header><p>
One of last week&rsquo;s lectionary texts was Romans 14:1-12.
</p>

<p>
&gt;Why do you pass judgment on your brother or sister? Or you, why do you despise your brother or sister? For we will all stand before the judgment seat of God. (Rom. 14:10, NRSV)
</p>

<p>
God of Grace,
</p>

<p>
In belittling others,<br>
I am made small.
</p>

<p>
By doubting their faith,<br>
I cheapen my own.
</p>

<p>
In my haste to judge,<br>
I am the one condemned.
</p>

<p>
The day will come,<br>
when my time on earth<br>
is finally weighed.
</p>

<p>
If I am found wanting,<br>
let it be for my<br>
failure to judge,<br>
and not for my<br>
failure to love.
</p>

<p>
<i>Amen</i>
</p>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 20, 2024. Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
